microchip-pic-avr-examples/dspic33ck-power-dcdc-dual-active-bridge-development-platform/dspic33ck-dab.X/sources/pwrctrl/dcdt/pwrctrl_dcdt.c
/**
  Generated main.c file from MPLAB Code Configurator

  @Company
    Microchip Technology Inc.

  @File Name
    dev_TPBLPFC_typedef.c

  @Summary
    This is the generated main.c using PIC24 / dsPIC33 / PIC32MM MCUs.

  @Description
    This source file provides main entry point for system initialization and application code development.
    Generation Information :
        Product Revision  :  PIC24 / dsPIC33 / PIC32MM MCUs - 1.170.0
        Device            :  dsPIC33CH512MP506S1
    The generated drivers are tested against the following:
        Compiler          :  XC16 v1.70
        MPLAB 	          :  MPLAB X v6.00
 */


/**
 * @file      pwrctrl_dcdt.c
 * @ingroup   pwrctrl-dcdt   
 * @brief     Contains individual DCDT control loop initialization functions. 
 */

#include <xc.h>

#include "pwrctrl_dcdt.h"


SMPS_PID_T VMC_pid;
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Data Object of voltage mode control generated by DCDT
 * 
 * @details The 'VMC_2p2z' data object holds the control loop parameter of the 
 *  Voltage loop.
 *******************************************************************************/
SMPS_2P2Z_T VMC_2p2z;
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Data Object of current mode control
 * 
 * @details The 'IMC_2p2z' data object holds the control loop parameter of the 
 *  Current loop.
 *******************************************************************************/
SMPS_2P2Z_T IMC_2p2z;
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Data Object of power mode control
 * 
 * @details The 'PMC_2p2z' data object holds the control loop parameter of the 
 *  Power loop.
 *******************************************************************************/
SMPS_2P2Z_T PMC_2p2z; 

//==============================================================================
//==============================================================================

/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Data Object of voltage mode control generated by DCDT
 * 
 * @details The 'VMC_2p2z_Rev' data object holds the control loop parameter of the 
 *  Voltage loop in Reverse direction.
 *******************************************************************************/
SMPS_2P2Z_T VMC_2p2z_Rev;
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Data Object of current mode control
 * 
 * @details The 'IMC_2p2z_Rev' data object holds the control loop parameter of the 
 *  Current loop in Reverse direction.
 *******************************************************************************/
SMPS_2P2Z_T IMC_2p2z_Rev;
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Data Object of power mode control
 * 
 * @details The 'PMC_2p2z_Rev' data object holds the control loop parameter of the 
 *  Power loop in Reverse direction.
 *******************************************************************************/
SMPS_2P2Z_T PMC_2p2z_Rev; 

//==============================================================================
//==============================================================================
int16_t   VMC_pidABCCoefficients[3]__attribute__((space(xmemory)));
int16_t   VMC_pidErrorHistory[3] __attribute__((space(ymemory), far));


/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Voltage Loop A-coefficient array
 * 
 * @details This array contains the A-coefficients of the z-domain compensation
 *  filter for voltage mode control.
 *******************************************************************************/
int16_t   VMC_2p2zACoefficients[2]__attribute__((space(xmemory)));
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Voltage Loop B-coefficient array
 * 
 * @details This array contains the B-coefficients of the z-domain compensation
 *  filter for voltage mode control.
 *******************************************************************************/
int16_t   VMC_2p2zBCoefficients[3] __attribute__((space(xmemory)));
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Voltage Loop Control history
 * 
 * @details This array contains the voltage loop control output history.
 *******************************************************************************/
int16_t   VMC_2p2zControlHistory[2] __attribute__((space(ymemory), far));
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Voltage Loop Error history
 * 
 * @details This array contains the error history of the voltage loop control.
 *******************************************************************************/
int16_t   VMC_2p2zErrorHistory[3] __attribute__((space(ymemory), far));

//==============================================================================
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Current Loop A-coefficient array
 * 
 * @details This array contains the A-coefficients of the z-domain compensation
 *  filter for current mode control.
 *******************************************************************************/
int16_t   IMC_2p2zACoefficients[2]__attribute__((space(xmemory)));
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Current Loop B-coefficient array
 * 
 * @details This array contains the B-coefficients of the z-domain compensation
 *  filter for current mode control.
 *******************************************************************************/
int16_t   IMC_2p2zBCoefficients[3] __attribute__((space(xmemory)));
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Current Loop Control history
 * 
 * @details This array contains the current loop control output history.
 *******************************************************************************/
int16_t   IMC_2p2zControlHistory[2] __attribute__((space(ymemory), far));
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Current Loop Error history
 * 
 * @details This array contains the error history of the current loop control.
 *******************************************************************************/
int16_t   IMC_2p2zErrorHistory[3] __attribute__((space(ymemory), far));

//==============================================================================
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Power Loop A-coefficient array
 * 
 * @details This array contains the A-coefficients of the z-domain compensation
 *  filter for power mode control.
 *******************************************************************************/
int16_t   PMC_2p2zACoefficients[2]__attribute__((space(xmemory)));
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Power Loop B-coefficient array
 * 
 * @details This array contains the B-coefficients of the z-domain compensation
 *  filter for power mode control.
 *******************************************************************************/
int16_t   PMC_2p2zBCoefficients[3] __attribute__((space(xmemory)));
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Power Loop Control history
 * 
 * @details This array contains the power loop control output history.
 *******************************************************************************/
int16_t   PMC_2p2zControlHistory[2] __attribute__((space(ymemory), far));
/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief Power Loop Error history
 * 
 * @details This array contains the error history of the power loop control.
 *******************************************************************************/
int16_t   PMC_2p2zErrorHistory[3] __attribute__((space(ymemory), far));


//==============================================================================
//==============================================================================

