microchip-pic-avr-examples/dspic33ck-power-dcdc-dual-active-bridge-development-platform/dspic33ck-dab.X/sources/pwrctrl/dcdt/pwrctrl_dcdt.c
  VMC_2p2z_Rev.preShift =   DAB_SPVO_COMP_2P2Z_PRESHIFT;  
  VMC_2p2z_Rev.postScaler = DAB_SPVO_COMP_2P2Z_POSTSCALER;
  VMC_2p2z_Rev.postShift =  DAB_SPVO_COMP_2P2Z_POSTSHIFT;
  VMC_2p2z_Rev.minOutput =  DAB_SPVO_COMP_2P2Z_MIN_CLAMP;
  VMC_2p2z_Rev.maxOutput =  DAB_SPVO_COMP_2P2Z_MAX_CLAMP; 
  
  VMC_2p2zACoefficients_Rev[0] = DAB_SPVO_COMP_2P2Z_COEFF_A1;
  VMC_2p2zACoefficients_Rev[1] = DAB_SPVO_COMP_2P2Z_COEFF_A2;
  VMC_2p2zBCoefficients_Rev[0] = DAB_SPVO_COMP_2P2Z_COEFF_B0;
  VMC_2p2zBCoefficients_Rev[1] = DAB_SPVO_COMP_2P2Z_COEFF_B1;
  VMC_2p2zBCoefficients_Rev[2] = DAB_SPVO_COMP_2P2Z_COEFF_B2; 
  
   //explicit clear to 0
  VMC_2p2zControlHistory_Rev[0] = 0;
  VMC_2p2zControlHistory_Rev[1] = 0;
  VMC_2p2zErrorHistory_Rev[0] = 0;
  VMC_2p2zErrorHistory_Rev[1] = 0;
  VMC_2p2zErrorHistory_Rev[2] = 0;
   
  SMPS_Controller2P2ZInitialize(&VMC_2p2z_Rev);  
  
}

/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief  Initialize the Current Loop Control
 * @return void
 * 
 * @details This function initializes the filter coefficients of current loop
 *  from the frequencies selected in the DCDT tool. The control and error
 *  histories of the current loop is also cleared.
 *********************************************************************************/
void PwrCtrl_IComp_Initialize(void)
{
   //charger
   IMC_2p2z.aCoefficients =  &IMC_2p2zACoefficients[0]; // Set up pointer to derived coefficients
   IMC_2p2z.bCoefficients =  &IMC_2p2zBCoefficients[0]; // Set up pointer to derived coefficients
   IMC_2p2z.controlHistory = &IMC_2p2zControlHistory[0]; // Set up pointer to controller history
   IMC_2p2z.errorHistory =   &IMC_2p2zErrorHistory[0]; // Set up pointer to error history

   IMC_2p2z.preShift =   DAB_PSIO_COMP_2P2Z_PRESHIFT;
   IMC_2p2z.postScaler = DAB_PSIO_COMP_2P2Z_POSTSCALER;
   IMC_2p2z.postShift =  DAB_PSIO_COMP_2P2Z_POSTSHIFT;
   IMC_2p2z.minOutput =  DAB_PSIO_COMP_2P2Z_MIN_CLAMP;
   IMC_2p2z.maxOutput =  DAB_PSIO_COMP_2P2Z_MAX_CLAMP;
   
   
   IMC_2p2zACoefficients[0] = DAB_PSIO_COMP_2P2Z_COEFF_A1;
   IMC_2p2zACoefficients[1] = DAB_PSIO_COMP_2P2Z_COEFF_A2;
   IMC_2p2zBCoefficients[0] = DAB_PSIO_COMP_2P2Z_COEFF_B0;
   IMC_2p2zBCoefficients[1] = DAB_PSIO_COMP_2P2Z_COEFF_B1;
   IMC_2p2zBCoefficients[2] = DAB_PSIO_COMP_2P2Z_COEFF_B2;
  
  //explicit clear to 0
   IMC_2p2zControlHistory[0] =0;
   IMC_2p2zControlHistory[1] =0;
   IMC_2p2zErrorHistory[0] =0;
   IMC_2p2zErrorHistory[1] =0;
   IMC_2p2zErrorHistory[2] =0;
   
   SMPS_Controller2P2ZInitialize(&IMC_2p2z);
   
   //discharger
   IMC_2p2z_Rev.aCoefficients =  &IMC_2p2zACoefficients_Rev[0]; // Set up pointer to derived coefficients
   IMC_2p2z_Rev.bCoefficients =  &IMC_2p2zBCoefficients_Rev[0]; // Set up pointer to derived coefficients
   IMC_2p2z_Rev.controlHistory = &IMC_2p2zControlHistory_Rev[0]; // Set up pointer to controller history
   IMC_2p2z_Rev.errorHistory =   &IMC_2p2zErrorHistory_Rev[0]; // Set up pointer to error history

   IMC_2p2z_Rev.preShift =   DAB_SPIO_COMP_2P2Z_PRESHIFT;//SPIO TBD
   IMC_2p2z_Rev.postScaler = DAB_SPIO_COMP_2P2Z_POSTSCALER;
   IMC_2p2z_Rev.postShift =  DAB_SPIO_COMP_2P2Z_POSTSHIFT;
   IMC_2p2z_Rev.minOutput =  DAB_SPIO_COMP_2P2Z_MIN_CLAMP;
   IMC_2p2z_Rev.maxOutput =  DAB_SPIO_COMP_2P2Z_MAX_CLAMP;
   
   
   IMC_2p2zACoefficients_Rev[0] = DAB_SPIO_COMP_2P2Z_COEFF_A1;
   IMC_2p2zACoefficients_Rev[1] = DAB_SPIO_COMP_2P2Z_COEFF_A2;
   IMC_2p2zBCoefficients_Rev[0] = DAB_SPIO_COMP_2P2Z_COEFF_B0;
   IMC_2p2zBCoefficients_Rev[1] = DAB_SPIO_COMP_2P2Z_COEFF_B1;
   IMC_2p2zBCoefficients_Rev[2] = DAB_SPIO_COMP_2P2Z_COEFF_B2;
  
  //explicit clear to 0
   IMC_2p2zControlHistory_Rev[0] =0;
   IMC_2p2zControlHistory_Rev[1] =0;
   IMC_2p2zErrorHistory_Rev[0] =0;
   IMC_2p2zErrorHistory_Rev[1] =0;
   IMC_2p2zErrorHistory_Rev[2] =0;
   
   SMPS_Controller2P2ZInitialize(&IMC_2p2z_Rev);
}

/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief  Initialize the Power Loop Control
 * @return void
 * 
 * @details This function initializes the filter coefficients of power loop
 *  from the frequencies selected in the DCDT tool. The control and error
 *  histories of the power loop is also cleared.
 *********************************************************************************/
void PwrCtrl_PComp_Initialize(void)  //only battery has power sense option. should be bidirectional
{
    //charger
   PMC_2p2z.aCoefficients =  &PMC_2p2zACoefficients[0]; // Set up pointer to derived coefficients
   PMC_2p2z.bCoefficients =  &PMC_2p2zBCoefficients[0]; // Set up pointer to derived coefficients
   PMC_2p2z.controlHistory = &PMC_2p2zControlHistory[0]; // Set up pointer to controller history
   PMC_2p2z.errorHistory =   &PMC_2p2zErrorHistory[0]; // Set up pointer to error history

   PMC_2p2z.preShift =   DAB_PSPO_COMP_2P2Z_PRESHIFT;
   PMC_2p2z.postScaler = DAB_PSPO_COMP_2P2Z_POSTSCALER;
   PMC_2p2z.postShift =  DAB_PSPO_COMP_2P2Z_POSTSHIFT;
   PMC_2p2z.minOutput =  DAB_PSPO_COMP_2P2Z_MIN_CLAMP;
   PMC_2p2z.maxOutput =  DAB_PSPO_COMP_2P2Z_MAX_CLAMP; 
   
   PMC_2p2zACoefficients[0] = DAB_PSPO_COMP_2P2Z_COEFF_A1;
   PMC_2p2zACoefficients[1] = DAB_PSPO_COMP_2P2Z_COEFF_A2;
   PMC_2p2zBCoefficients[0] = DAB_PSPO_COMP_2P2Z_COEFF_B0;
   PMC_2p2zBCoefficients[1] = DAB_PSPO_COMP_2P2Z_COEFF_B1;
   PMC_2p2zBCoefficients[2] = DAB_PSPO_COMP_2P2Z_COEFF_B2;
  
    //explicit clear to 0
   PMC_2p2zControlHistory[0] =0;
   PMC_2p2zControlHistory[1] =0;
   PMC_2p2zErrorHistory[0] =0;
   PMC_2p2zErrorHistory[1] =0;
   PMC_2p2zErrorHistory[2] =0;
   
   SMPS_Controller2P2ZInitialize(&PMC_2p2z);  
   
   
   //discharger
   PMC_2p2z_Rev.aCoefficients =  &PMC_2p2zACoefficients_Rev[0]; // Set up pointer to derived coefficients
   PMC_2p2z_Rev.bCoefficients =  &PMC_2p2zBCoefficients_Rev[0]; // Set up pointer to derived coefficients
   PMC_2p2z_Rev.controlHistory = &PMC_2p2zControlHistory_Rev[0]; // Set up pointer to controller history
   PMC_2p2z_Rev.errorHistory =   &PMC_2p2zErrorHistory_Rev[0]; // Set up pointer to error history

